#+title:  Evaluaci贸n de la exposici贸n
#+author: Gunnar Wolf

* /Listener/: Prop贸sito, interacci贸n y usos

- Tema presentado por :: Erick Nava y Eric Ram铆rez
- Calificaci贸n global :: Por favor lean todo el archivo para entender de d贸nde
  vienen todos estos n煤meros 

|------------------------+------+--------------------+------+---------|
| Evaluaci贸n  compa帽eros | Peso | Evaluaci贸n docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                   9.23 |  0.3 |                8.8 |  0.7 |    8.93 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Comentarios

Dado que es una presentaci贸n en video, no puedo evaluar /dominio del tema/ y
/presencia/ como lo har铆amos habitualmente. Me centro en las respuestas que
hagan a las preguntas de sus compa帽eros para el primero y en si la presentaci贸n
"suena" le铆da directamente del material que prepararon o expuesta m谩s libremente
para el segundo.


* Evaluaci贸n grupal

|              | 1 | 2 | 3 | 4 |  5 | Total |
|--------------+---+---+---+---+----+-------|
| Originalidad | 0 | 0 | 0 | 1 | 12 |  9.85 |
| Nivel        | 0 | 0 | 1 | 3 |  9 |  9.23 |
| Relevancia   | 0 | 0 | 2 | 2 |  9 |  9.08 |
| Claridad     | 0 | 2 | 0 | 1 | 10 |  8.92 |
| Presencia    | 1 | 0 | 1 | 0 | 11 |  9.08 |
|--------------+---+---+---+---+----+-------|
|              |   |   |   |   |    |  9.23 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compa帽eros

Su exposici贸n recibi贸 los siguientes comentarios anonimizados por
parte de sus compa帽eros:

- Ning煤n comentario 

* Evaluaci贸n por parte del docente

| *Aspecto*                          | *Peso* | *Evaluaci贸n* | *Puntos* |
|------------------------------------+--------+--------------+----------|
| Contenido t茅cnico y profunidad     |    0.3 |           10 |       3. |
| Fuentes bibliogr谩ficas             |   0.15 |           10 |      1.5 |
| Organizaci贸n                       |   0.15 |            7 |     1.05 |
| Comunicaci贸n oral y uso del tiempo |   0.25 |            7 |     1.75 |
| Uso de recursos visuales           |   0.15 |           10 |      1.5 |
|------------------------------------+--------+--------------+----------|
| *Global*                           |        |              |     8.80 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios del docente
- Me parece excelente que hayan desarrollado la exposici贸n /cont谩ndole
  informalmente/ a quien los sigue cada uno de los temas que van cubriendo:
  No van expresamente leyendo el gui贸n (o lo hacen de forma que no se
  nota).
- Me parece un enfoque muy interesante el hablar del patr贸n /Listener/
  vincul谩ndolo con c贸mo se implementa en Linux, pasando por los ejemplos de
  /Watcher/. 隆Muy bien! 
- Como ustedes mismos lo dijeron varias veces, no es lo mismo un /Listener/
  en t茅rminos de patr贸n de desarrollo que el programa /Oracle Listener/ que
  mostraron a forma de ilustraci贸n. Me qued贸 la duda de por qu茅, sabiendo
  que no est谩 vinculado directamente con la parte de la presentaci贸n,
  decidieron incluir esta parte (y pasarse del tiempo especificado!) 

